Autodesk.Revit.Creation.Application.NewReferencePointArray
Creates an empty array that can store ReferencePoint objects.
Returns: An empty array that can hold ReferencePoint objects.
Remarks: This method can be used to create an array that can hold ReferencePoint objects. This
array can be then passed to methods, such as NewCurveByPoints, to represent two or more PointElements.

Autodesk.Revit.Creation.Application.NewPointRelativeToPoint(Autodesk.Revit.DB.Reference)
Create a PointRelativeToPoint object, which is used to define
the placement of a ReferencePoint relative to a host point.
hostPointReference: The reference of the host point.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument hostPointReference is null.
Returns: If creation is successful then a new PointRelativeToPoint object is returned,
otherwise an exception with failure information will be thrown.
Since: 2013

Autodesk.Revit.Creation.Application.NewPointOnEdgeFaceIntersection(Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.Reference,System.Boolean)
Construct a PointOnEdgeFaceIntersection object which is used to define the placement of a ReferencePoint given a references to edge and a reference to face.
edgeReference: The edge reference.
faceReference: The face reference.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument edgeReference or faceReference is null.
Returns: A new PointOnEdgeFaceIntersection object.

Autodesk.Revit.Creation.Application.NewPointOnEdgeEdgeIntersection(Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.Reference)
Construct a PointOnEdgeEdgeIntersection object which is used to define the placement of a ReferencePoint given two references to edge.
edgeReference1: The first edge reference.
edgeReference2: The second edge reference.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument edgeReference1 or edgeReference2 is null.
Returns: A new PointOnEdgeEdgeIntersection object.

Autodesk.Revit.Creation.Application.NewPointOnFace(Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.UV)
Construct a PointOnFace object which is used to define the placement of a ReferencePoint given a reference and a location on the face.
faceReference: The reference whose face the object will be created on.
uv: A 2-dimensional position.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument faceReference or uv is null.
Returns: A new PointOnFace object.

Autodesk.Revit.Creation.Application.NewPointOnPlane(Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.UV,Autodesk.Revit.DB.UV,System.Double)
Construct a PointOnPlane object which is used to define the placement of a ReferencePoint from its property values.
planeReference: A reference to some plane
in the document. (Note: the reference must satisfy
IsValidPlaneReference(),
but this is not checked until this PointOnPlane object
is assigned to a ReferencePoint.)
position: Coordinates of the point's projection onto the plane;
see the Position property.
xvec: The direction of the point's
X-coordinate vector in the plane's coordinates; see the XVec property. Optional;
default value is (1, 0).
offset: Signed offset from the plane; see the Offset property.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument planeReference or position or xvec is null or offset is not a valid double value.
Returns: A new PointOnPlane object with 2-dimensional Position, XVec, and Offset
properties set to match the given 3-dimensional arguments.

Autodesk.Revit.Creation.Application.NewPointOnEdge(Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.PointLocationOnCurve)
Create a PointOnEdge object which is used to define the placement of a ReferencePoint.
edgeReference: The reference whose edge the object will be created on.
locationOnCurve: The location on the edge.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the input argument edgeReference or locationOnCurve is null.
Returns: If creation was successful then a new object is returned,
otherwise an exception with failure information will be thrown.

Autodesk.Revit.Creation.Application.NewFamilySymbolProfile(Autodesk.Revit.DB.FamilySymbol)
Creates a new FamilySymbolProfile object.
familySymbol: The family symbol of the Profile.
Returns: The new FamilySymbolProfile object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the argument familySymbol is null.

Autodesk.Revit.Creation.Application.NewCurveLoopsProfile(Autodesk.Revit.DB.CurveArrArray)
Creates a new CurveLoopsProfile object.
curveLoops: The curve loops of the Profile.
Returns: The new CurveLoopsProfile object.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
Thrown when the argument is null.

Autodesk.Revit.Creation.Application.NewElementId
Creates a new Autodesk::Revit::DB::ElementId^ object.
Returns: The new Autodesk::Revit::DB::ElementId^ object.

Autodesk.Revit.Creation.Application.NewAreaCreationData(Autodesk.Revit.DB.ViewPlan,Autodesk.Revit.DB.UV)
Creates an object which wraps the arguments of Area for batch creation.
areaView: The view of area element.
point: A point which lies in an enclosed region of area boundary where the new area will reside.
Returns: The object containing the data needed for area creation.

Autodesk.Revit.Creation.Application.NewFamilyInstanceCreationData(Autodesk.Revit.DB.FamilySymbol,System.Collections.Generic.IList{Autodesk.Revit.DB.XYZ})
Creates an adaptive component which wraps the arguments of NewFamilyInstance() for batch creation.
Creates an object which wraps the arguments of NewFamilyInstance() for batch creation.
symbol:  A FamilySymbol object that represents the type of the instance that is to be inserted.
adaptivePoints:  The adaptive point location where the adaptive instance is to be placed.

Autodesk.Revit.Creation.Application.NewFamilyInstanceCreationData(Autodesk.Revit.DB.Face,Autodesk.Revit.DB.Line,Autodesk.Revit.DB.FamilySymbol)
Creates an object which wraps the arguments of NewFamilyInstance() for batch creation.
face: A face of a geometry object.
position: A line on the face defining where the symbol is to be placed.
symbol: A FamilySymbol object that represents the type of the instance that is to be inserted.

Autodesk.Revit.Creation.Application.NewFamilyInstanceCreationData(Autodesk.Revit.DB.Face,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.FamilySymbol)
Creates an object which wraps the arguments of NewFamilyInstance() for batch creation.
face: A face of a geometry object.
location: Point on the face where the instance is to be placed.
referenceDirection: A vector that defines the direction of the family instance.
symbol: A FamilySymbol object that represents the type of the instance that is to be inserted.

Autodesk.Revit.Creation.Application.NewFamilyInstanceCreationData(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.FamilySymbol,Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.Element,Autodesk.Revit.DB.Structure.StructuralType)
Creates an object which wraps the arguments of NewFamilyInstance() for batch creation.
location:  The physical location where the instance is to be placed.
symbol:  A FamilySymbol object that represents the type of the instance that is to be inserted.
referenceDirection:  A vector that dictates the direction of certain family instances.
host:  The object into which the family instance is to be inserted, often known as the host.
structuralType:  If structural then specify the type of the component.

Autodesk.Revit.Creation.Application.NewFamilyInstanceCreationData(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.FamilySymbol,Autodesk.Revit.DB.Element,Autodesk.Revit.DB.Level,Autodesk.Revit.DB.Structure.StructuralType)
Creates an object which wraps the arguments of NewFamilyInstance() for batch creation.
location:  The physical location where the instance is to be placed.
symbol:  A FamilySymbol object that represents the type of the instance that is to be inserted.
host:  The object into which the family instance is to be inserted, often known as the host.
level: A Level object that is used as the base level for the object.
structuralType:  If structural then specify the type of the component.

Autodesk.Revit.Creation.Application.NewFamilyInstanceCreationData(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.FamilySymbol,Autodesk.Revit.DB.Element,Autodesk.Revit.DB.Structure.StructuralType)
Creates an object which wraps the arguments of NewFamilyInstance() for batch creation.
location:  The physical location where the instance is to be placed.
symbol:  A FamilySymbol object that represents the type of the instance that is to be inserted.
host:  The object into which the family instance is to be inserted, often known as the host.
structuralType:  If structural then specify the type of the component.

Autodesk.Revit.Creation.Application.NewFamilyInstanceCreationData(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.FamilySymbol,Autodesk.Revit.DB.Level,Autodesk.Revit.DB.Structure.StructuralType)
Creates an object which wraps the arguments of NewFamilyInstance() for batch creation.
location:  The physical location where the instance is to be placed.
symbol:  A FamilySymbol object that represents the type of the instance that is to be inserted.
level:  A Level object that is used as the base level for the object.
structuralType:  If structural then specify the type of the component.

Autodesk.Revit.Creation.Application.NewFamilyInstanceCreationData(Autodesk.Revit.DB.Curve,Autodesk.Revit.DB.FamilySymbol,Autodesk.Revit.DB.Level,Autodesk.Revit.DB.Structure.StructuralType)
Creates an object which wraps the arguments of NewFamilyInstance() for batch creation.
curve:  The curve where the instance is based.
symbol:  A FamilySymbol object that represents the type of the instance that is to be inserted.
level:  A Level object that is used as the base level for the object.
structuralType:  If structural then specify the type of the component.

Autodesk.Revit.Creation.Application.NewFamilyInstanceCreationData(Autodesk.Revit.DB.XYZ,Autodesk.Revit.DB.FamilySymbol,Autodesk.Revit.DB.Structure.StructuralType)
Creates an object which wraps the arguments of NewFamilyInstance() for batch creation.
Creates an object which wraps the arguments of NewFamilyInstance() for batch creation.
location:  The physical location where the instance is to be placed.
symbol:  A FamilySymbol object that represents the type of the instance that is to be inserted.
structuralType:  Specify if the family instance is structural.

Autodesk.Revit.Creation.Application.NewSpaceSet
Creates a new instance of a space set.

Autodesk.Revit.Creation.Application.NewViewSet
Creates a new instance of a View set.

Autodesk.Revit.Creation.Application.NewIntersectionResultArray
Creates a new instance of an IntersectionResult array.

Autodesk.Revit.Creation.Application.NewFaceArray
Creates a new instance of a face array.

Autodesk.Revit.Creation.Application.NewReferenceArray
Creates a new instance of a reference array.

Autodesk.Revit.Creation.Application.NewDoubleArray
Creates a new instance of a double array.

Autodesk.Revit.Creation.Application.NewGBXMLImportOptions
Creates Green-Building XML Import options.

Autodesk.Revit.Creation.Application.NewImageImportOptions
Creates Image Import options.

Autodesk.Revit.Creation.Application.NewFBXExportOptions
Creates 3D-Studio Max (FBX) Export options.

Autodesk.Revit.Creation.Application.NewDWFXExportOptions
Creates DWFX Export options.

Autodesk.Revit.Creation.Application.NewDWFExportOptions
Creates DWF Export options.

Autodesk.Revit.Creation.Application.NewUV(Autodesk.Revit.DB.UV)
Creates a UV object by copying the supplied UV object.
uv: The supplied UV object

Autodesk.Revit.Creation.Application.NewUV(System.Double,System.Double)
Creates a UV object representing coordinates in 2-space with supplied values.
u: The first coordinate.
v: The second coordinate.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when setting an infinite number to the U or V property.

Autodesk.Revit.Creation.Application.NewUV
Creates a UV object representing coordinates in 2-space.
Creates a UV object at the origin.

Autodesk.Revit.Creation.Application.NewXYZ(Autodesk.Revit.DB.XYZ)
Creates a XYZ object by copying the supplied XYZ object.
xyz: The supplied XYZ object

Autodesk.Revit.Creation.Application.NewXYZ(System.Double,System.Double,System.Double)
Creates a XYZ object representing coordinates in 3-space with supplied values.
x: The first coordinate.
y: The second coordinate.
z: The third coordinate.
Throws Autodesk.Revit.Exceptions.ArgumentException:
Thrown when setting an infinite number to the X, Y or Z property.

Autodesk.Revit.Creation.Application.NewXYZ
Creates a XYZ object representing coordinates in 3-space.
Creates a XYZ object at the origin.

Autodesk.Revit.Creation.Application.NewBoundingBoxUV(System.Double,System.Double,System.Double,System.Double)
Creates a two-dimensional rectangle with supplied values.
min_u: The first coordinate of min.
min_v: The second coordinate of min.
max_u: The first coordinate of max.
max_v: The second coordinate of max.

Autodesk.Revit.Creation.Application.NewBoundingBoxUV
Creates a two-dimensional rectangle.
Creates an empty two-dimensional rectangle.

Autodesk.Revit.Creation.Application.NewBoundingBoxXYZ
Creates a three-dimensional rectangular box.

Autodesk.Revit.Creation.Application.NewProjectPosition(System.Double,System.Double,System.Double,System.Double)
Creates a new project position object.
ew: East to West offset in feet.
ns: North to South offset in feet.
elevation: Elevation above sea level in feet.
angle: Rotation angle away from true north in the range of -PI to +PI.
Remarks: This object contains offset information and is used by the project location object
for setting the project location relative to the site location. Measurements are in feet and
radians.

Autodesk.Revit.Creation.Application.NewColor
Returns a new color object.
Returns: The new color object.

Autodesk.Revit.Creation.Application.NewCombinableElementArray
Returns an array that can hold combinable element objects.
Returns: An empty array that can contain any CombinableElement derived objects.

Autodesk.Revit.Creation.Application.NewVertexIndexPairArray
Returns an array that can hold VertexIndexPair objects.
Returns: The new VertexIndexPairArray objects.

Autodesk.Revit.Creation.Application.NewVertexIndexPair(System.Int32,System.Int32)
Creates a new VertexIndexPair object.
iTop: The index of the vertex pair from the top profile of a blend.
iBottom: The index of the vertex pair from the bottom profile of a blend.
Returns: The new VertexIndexPair object.

Autodesk.Revit.Creation.Application.NewCurveArrArray
Creates an empty array that can store geometric curve loops.
Returns: The empty array of curve loops.

Autodesk.Revit.Creation.Application.NewCurveArray
Creates an empty array that can store geometric curves.
Returns: An empty array that can hold geometric curves.
Remarks: This method can be used to create an array that can hold any curve type object. This
array can be then passed to methods, such as NewAreaLoad, to represent the geometry for the
boundary of the load.

Autodesk.Revit.Creation.Application.NewGeometryOptions
Creates an object to specify user preferences in parsing of geometry.

Autodesk.Revit.Creation.Application.NewElementSet
Creates a new instance of a set specifically for holding elements.
Returns: A new Element Set.
Remarks: This is a general purpose set for passing elements to and from methods.

Autodesk.Revit.Creation.Application.NewTypeBinding(Autodesk.Revit.DB.CategorySet)
Creates a new type binding object containing the categories passed as a parameter.
categorySet: A set of categories that will be added to the binding.
Returns: A new type binding object.
Remarks: Type binding objects are used for attaching shared parameter definitions to a type
within a category.

Autodesk.Revit.Creation.Application.NewTypeBinding
Creates a new type binding object.
Creates a new empty type binding object.
Returns: A new type binding object.
Remarks: Type binding objects are used for attaching shared parameter definitions to a type
within a category. Categories can be added to the instance binding via the Categories property of
the InstanceBinding object

Autodesk.Revit.Creation.Application.NewInstanceBinding(Autodesk.Revit.DB.CategorySet)
Creates a new instance binding object containing the categories passed as a parameter.
categorySet: A set of categories that will be added to the binding.
Returns: A new instance binding object.
Remarks: Instance binding objects are used for attaching shared parameter definitions to all
instances of an element within a category.

Autodesk.Revit.Creation.Application.NewInstanceBinding
Creates a new instance binding object.
Creates a new empty instance binding object.
Returns: A new instance binding object.
Remarks: Instance binding objects are used for attaching shared parameter definitions to all
instances of an element within a category. Categories can be added to the instance binding via
the Categories property of the InstanceBinding object

Autodesk.Revit.Creation.Application.NewCategorySet
Creates a new instance of a set specifically for holding category objects.
Returns: A new instance of a Category Set.
Remarks: This type of set is used during the creation of instance and type bindings.

Autodesk.Revit.Creation.Application
The Application Creation object is used to create new instances of utility objects.
Remarks:
General purpose objects can be generated by this creation object. Creating objects
via this object ensures that they will be correctly constructed and will reside in the
Autodesk Revit memory space.